espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/assist_debug_reg.h
/** ASSIST_DEBUG_CORE_1_AREA_PIF_0_MIN_REG register
 *  core1 PIF region0 addr configuration register
 */
#define ASSIST_DEBUG_CORE_1_AREA_PIF_0_MIN_REG (DR_REG_ASSIST_DEBUG_BASE + 0xa0)
/** ASSIST_DEBUG_CORE_1_AREA_PIF_0_MIN : R/W; bitpos: [31:0]; default: 4294967295;
 *  Core1 PIF region0 start addr
 */
#define ASSIST_DEBUG_CORE_1_AREA_PIF_0_MIN    0xFFFFFFFFU
#define ASSIST_DEBUG_CORE_1_AREA_PIF_0_MIN_M  (ASSIST_DEBUG_CORE_1_AREA_PIF_0_MIN_V << ASSIST_DEBUG_CORE_1_AREA_PIF_0_MIN_S)
#define ASSIST_DEBUG_CORE_1_AREA_PIF_0_MIN_V  0xFFFFFFFFU
#define ASSIST_DEBUG_CORE_1_AREA_PIF_0_MIN_S  0

/** ASSIST_DEBUG_CORE_1_AREA_PIF_0_MAX_REG register
 *  core1 PIF region0 addr configuration register
 */
#define ASSIST_DEBUG_CORE_1_AREA_PIF_0_MAX_REG (DR_REG_ASSIST_DEBUG_BASE + 0xa4)
/** ASSIST_DEBUG_CORE_1_AREA_PIF_0_MAX : R/W; bitpos: [31:0]; default: 0;
 *  Core1 PIF region0 end addr
 */
#define ASSIST_DEBUG_CORE_1_AREA_PIF_0_MAX    0xFFFFFFFFU
#define ASSIST_DEBUG_CORE_1_AREA_PIF_0_MAX_M  (ASSIST_DEBUG_CORE_1_AREA_PIF_0_MAX_V << ASSIST_DEBUG_CORE_1_AREA_PIF_0_MAX_S)
#define ASSIST_DEBUG_CORE_1_AREA_PIF_0_MAX_V  0xFFFFFFFFU
#define ASSIST_DEBUG_CORE_1_AREA_PIF_0_MAX_S  0

/** ASSIST_DEBUG_CORE_1_AREA_PIF_1_MIN_REG register
 *  core1 PIF region1 addr configuration register
 */
#define ASSIST_DEBUG_CORE_1_AREA_PIF_1_MIN_REG (DR_REG_ASSIST_DEBUG_BASE + 0xa8)
/** ASSIST_DEBUG_CORE_1_AREA_PIF_1_MIN : R/W; bitpos: [31:0]; default: 4294967295;
 *  Core1 PIF region1 start addr
 */
#define ASSIST_DEBUG_CORE_1_AREA_PIF_1_MIN    0xFFFFFFFFU
#define ASSIST_DEBUG_CORE_1_AREA_PIF_1_MIN_M  (ASSIST_DEBUG_CORE_1_AREA_PIF_1_MIN_V << ASSIST_DEBUG_CORE_1_AREA_PIF_1_MIN_S)
#define ASSIST_DEBUG_CORE_1_AREA_PIF_1_MIN_V  0xFFFFFFFFU
#define ASSIST_DEBUG_CORE_1_AREA_PIF_1_MIN_S  0

/** ASSIST_DEBUG_CORE_1_AREA_PIF_1_MAX_REG register
 *  core1 PIF region1 addr configuration register
 */
#define ASSIST_DEBUG_CORE_1_AREA_PIF_1_MAX_REG (DR_REG_ASSIST_DEBUG_BASE + 0xac)
/** ASSIST_DEBUG_CORE_1_AREA_PIF_1_MAX : R/W; bitpos: [31:0]; default: 0;
 *  Core1 PIF region1 end addr
 */
#define ASSIST_DEBUG_CORE_1_AREA_PIF_1_MAX    0xFFFFFFFFU
#define ASSIST_DEBUG_CORE_1_AREA_PIF_1_MAX_M  (ASSIST_DEBUG_CORE_1_AREA_PIF_1_MAX_V << ASSIST_DEBUG_CORE_1_AREA_PIF_1_MAX_S)
#define ASSIST_DEBUG_CORE_1_AREA_PIF_1_MAX_V  0xFFFFFFFFU
#define ASSIST_DEBUG_CORE_1_AREA_PIF_1_MAX_S  0

/** ASSIST_DEBUG_CORE_1_AREA_PC_REG register
 *  core1 area pc status register
 */
#define ASSIST_DEBUG_CORE_1_AREA_PC_REG (DR_REG_ASSIST_DEBUG_BASE + 0xb0)
/** ASSIST_DEBUG_CORE_1_AREA_PC : RO; bitpos: [31:0]; default: 0;
 *  the stackpointer when first touch region monitor interrupt
 */
#define ASSIST_DEBUG_CORE_1_AREA_PC    0xFFFFFFFFU
#define ASSIST_DEBUG_CORE_1_AREA_PC_M  (ASSIST_DEBUG_CORE_1_AREA_PC_V << ASSIST_DEBUG_CORE_1_AREA_PC_S)
#define ASSIST_DEBUG_CORE_1_AREA_PC_V  0xFFFFFFFFU
#define ASSIST_DEBUG_CORE_1_AREA_PC_S  0

/** ASSIST_DEBUG_CORE_1_AREA_SP_REG register
 *  core1 area sp status register
 */
#define ASSIST_DEBUG_CORE_1_AREA_SP_REG (DR_REG_ASSIST_DEBUG_BASE + 0xb4)
/** ASSIST_DEBUG_CORE_1_AREA_SP : RO; bitpos: [31:0]; default: 0;
 *  the PC when first touch region monitor interrupt
 */
#define ASSIST_DEBUG_CORE_1_AREA_SP    0xFFFFFFFFU
#define ASSIST_DEBUG_CORE_1_AREA_SP_M  (ASSIST_DEBUG_CORE_1_AREA_SP_V << ASSIST_DEBUG_CORE_1_AREA_SP_S)
#define ASSIST_DEBUG_CORE_1_AREA_SP_V  0xFFFFFFFFU
#define ASSIST_DEBUG_CORE_1_AREA_SP_S  0

/** ASSIST_DEBUG_CORE_1_SP_MIN_REG register
 *  stack min value
 */
#define ASSIST_DEBUG_CORE_1_SP_MIN_REG (DR_REG_ASSIST_DEBUG_BASE + 0xb8)
/** ASSIST_DEBUG_CORE_1_SP_MIN : R/W; bitpos: [31:0]; default: 0;
 *  core1 sp region configuration register
 */
#define ASSIST_DEBUG_CORE_1_SP_MIN    0xFFFFFFFFU
#define ASSIST_DEBUG_CORE_1_SP_MIN_M  (ASSIST_DEBUG_CORE_1_SP_MIN_V << ASSIST_DEBUG_CORE_1_SP_MIN_S)
#define ASSIST_DEBUG_CORE_1_SP_MIN_V  0xFFFFFFFFU
#define ASSIST_DEBUG_CORE_1_SP_MIN_S  0

/** ASSIST_DEBUG_CORE_1_SP_MAX_REG register
 *  stack max value
 */
#define ASSIST_DEBUG_CORE_1_SP_MAX_REG (DR_REG_ASSIST_DEBUG_BASE + 0xbc)
/** ASSIST_DEBUG_CORE_1_SP_MAX : R/W; bitpos: [31:0]; default: 4294967295;
 *  core1 sp pc status register
 */
#define ASSIST_DEBUG_CORE_1_SP_MAX    0xFFFFFFFFU
#define ASSIST_DEBUG_CORE_1_SP_MAX_M  (ASSIST_DEBUG_CORE_1_SP_MAX_V << ASSIST_DEBUG_CORE_1_SP_MAX_S)
#define ASSIST_DEBUG_CORE_1_SP_MAX_V  0xFFFFFFFFU
#define ASSIST_DEBUG_CORE_1_SP_MAX_S  0

/** ASSIST_DEBUG_CORE_1_SP_PC_REG register
 *  stack monitor pc status register
 */
#define ASSIST_DEBUG_CORE_1_SP_PC_REG (DR_REG_ASSIST_DEBUG_BASE + 0xc0)
/** ASSIST_DEBUG_CORE_1_SP_PC : RO; bitpos: [31:0]; default: 0;
 *  This register stores the PC when trigger stack monitor.
 */
#define ASSIST_DEBUG_CORE_1_SP_PC    0xFFFFFFFFU
#define ASSIST_DEBUG_CORE_1_SP_PC_M  (ASSIST_DEBUG_CORE_1_SP_PC_V << ASSIST_DEBUG_CORE_1_SP_PC_S)
#define ASSIST_DEBUG_CORE_1_SP_PC_V  0xFFFFFFFFU
#define ASSIST_DEBUG_CORE_1_SP_PC_S  0

/** ASSIST_DEBUG_CORE_1_RCD_EN_REG register
 *  record enable configuration register
 */
#define ASSIST_DEBUG_CORE_1_RCD_EN_REG (DR_REG_ASSIST_DEBUG_BASE + 0xc4)
/** ASSIST_DEBUG_CORE_1_RCD_RECORDEN : R/W; bitpos: [0]; default: 0;
 *  Set 1 to enable record PC
 */
#define ASSIST_DEBUG_CORE_1_RCD_RECORDEN    (BIT(0))
#define ASSIST_DEBUG_CORE_1_RCD_RECORDEN_M  (ASSIST_DEBUG_CORE_1_RCD_RECORDEN_V << ASSIST_DEBUG_CORE_1_RCD_RECORDEN_S)
#define ASSIST_DEBUG_CORE_1_RCD_RECORDEN_V  0x00000001U
#define ASSIST_DEBUG_CORE_1_RCD_RECORDEN_S  0
/** ASSIST_DEBUG_CORE_1_RCD_PDEBUGEN : R/W; bitpos: [1]; default: 0;
 *  Set 1 to enable cpu pdebug function, must set this bit can get cpu PC
 */
#define ASSIST_DEBUG_CORE_1_RCD_PDEBUGEN    (BIT(1))
#define ASSIST_DEBUG_CORE_1_RCD_PDEBUGEN_M  (ASSIST_DEBUG_CORE_1_RCD_PDEBUGEN_V << ASSIST_DEBUG_CORE_1_RCD_PDEBUGEN_S)
#define ASSIST_DEBUG_CORE_1_RCD_PDEBUGEN_V  0x00000001U
#define ASSIST_DEBUG_CORE_1_RCD_PDEBUGEN_S  1

/** ASSIST_DEBUG_CORE_1_RCD_PDEBUGPC_REG register
 *  record status register
 */
#define ASSIST_DEBUG_CORE_1_RCD_PDEBUGPC_REG (DR_REG_ASSIST_DEBUG_BASE + 0xc8)
/** ASSIST_DEBUG_CORE_1_RCD_PDEBUGPC : RO; bitpos: [31:0]; default: 0;
 *  recorded PC
 */
#define ASSIST_DEBUG_CORE_1_RCD_PDEBUGPC    0xFFFFFFFFU
#define ASSIST_DEBUG_CORE_1_RCD_PDEBUGPC_M  (ASSIST_DEBUG_CORE_1_RCD_PDEBUGPC_V << ASSIST_DEBUG_CORE_1_RCD_PDEBUGPC_S)
#define ASSIST_DEBUG_CORE_1_RCD_PDEBUGPC_V  0xFFFFFFFFU
#define ASSIST_DEBUG_CORE_1_RCD_PDEBUGPC_S  0

/** ASSIST_DEBUG_CORE_1_RCD_PDEBUGSP_REG register
 *  record status register
 */
#define ASSIST_DEBUG_CORE_1_RCD_PDEBUGSP_REG (DR_REG_ASSIST_DEBUG_BASE + 0xcc)
/** ASSIST_DEBUG_CORE_1_RCD_PDEBUGSP : RO; bitpos: [31:0]; default: 0;
 *  recorded sp
 */
#define ASSIST_DEBUG_CORE_1_RCD_PDEBUGSP    0xFFFFFFFFU
#define ASSIST_DEBUG_CORE_1_RCD_PDEBUGSP_M  (ASSIST_DEBUG_CORE_1_RCD_PDEBUGSP_V << ASSIST_DEBUG_CORE_1_RCD_PDEBUGSP_S)
#define ASSIST_DEBUG_CORE_1_RCD_PDEBUGSP_V  0xFFFFFFFFU
#define ASSIST_DEBUG_CORE_1_RCD_PDEBUGSP_S  0

